# Зчитуємо розміри прямокутного паралелепіпеда з командного рядка
довжина = float(input("Введіть довжину: "))
ширина = float(input("Введіть ширину: "))
висота = float(input("Введіть висоту: "))

# Обчислюємо об'єм паралелепіпеда
об_єм = довжина * ширина * висота  # замінено об'єм на об_єм

# Обчислюємо площу поверхні паралелепіпеда
площа_поверхні = 2 * (довжина * ширина + ширина * висота + довжина * висота)

# Виводимо результати обчислень
print(f"Об'єм: {об_єм}")
print(f"Площа поверхні: {площа_поверхні}")